In [1]:
import pyodbc
import pandas as pd

In [2]:
conn = pyodbc.connect(
    "Driver={ODBC Driver 17 for SQL Server};"
    "Server=HP;"
    "Database=Project5;"
    "Trusted_Connection=yes;"
)

df = pd.read_sql("SELECT TOP 10 * FROM [dbo].[Sales Details];", conn)
df

C:\Users\Pavan Javale\AppData\Local\Temp\ipykernel_29928\1076345396.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT TOP 10 * FROM [dbo].[Sales Details];", conn)

,OrderID,OrderDate,CustomerID,ProductID,Region,Quantity,UnitPrice,Cost,Profit
0,5001,2024-10-01,1076,17,South,9,824,104.0,6480
1,5016,2023-10-31,1087,17,South,9,234,104.0,1170
2,5032,2024-11-03,1028,17,West,9,814,104.0,6390
3,5034,2024-08-09,1084,17,East,1,212,104.0,108
4,5048,2023-06-12,1010,17,South,7,610,104.0,3542
5,5070,2023-12-31,1035,17,East,7,582,104.0,3346
6,5124,2023-04-14,1020,17,West,8,624,104.0,4160
7,5134,2024-05-20,1091,17,East,6,298,104.0,1164
8,5179,2024-10-18,1059,17,North,3,465,104.0,1083
9,5188,2024-10-02,1013,17,East,8,110,104.0,48

In [3]:
Product = pd.read_sql( "select * from [dbo].[Product Details];", conn)
Sales = pd.read_sql( "select * from [dbo].[Sales Details];",conn)
Customer = pd.read_sql( "select * from [dbo].[Customers Details];",conn)

Sales.head()

C:\Users\Pavan Javale\AppData\Local\Temp\ipykernel_29928\1127693335.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  Product = pd.read_sql( "select * from [dbo].[Product Details];", conn)
C:\Users\Pavan Javale\AppData\Local\Temp\ipykernel_29928\1127693335.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  Sales = pd.read_sql( "select * from [dbo].[Sales Details];",conn)
C:\Users\Pavan Javale\AppData\Local\Temp\ipykernel_29928\1127693335.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  Customer = pd.read_sql( "select * from [dbo].[Customers Details];",conn)

,OrderID,OrderDate,CustomerID,ProductID,Region,Quantity,UnitPrice,Cost,Profit
0,5001,2024-10-01,1076,17,South,9,824,104.0,6480.0
1,5016,2023-10-31,1087,17,South,9,234,104.0,1170.0
2,5032,2024-11-03,1028,17,West,9,814,104.0,6390.0
3,5034,2024-08-09,1084,17,East,1,212,104.0,108.0
4,5048,2023-06-12,1010,17,South,7,610,104.0,3542.0

In [4]:
Product.isnull().sum()

ProductID      0
ProductName    0
Category       0
Cost           0
dtype: int64

In [5]:
Customer

    CustomerID  CustomerName         Segment       City
0         1001    Customer_1        Consumer      Delhi
1         1002    Customer_2  Small Business      Delhi
2         1003    Customer_3  Small Business     Nanded
3         1004    Customer_4        Consumer       Pune
4         1005    Customer_5        Consumer  Bangalore
..         ...           ...             ...        ...
95        1096   Customer_96  Small Business  Bangalore
96        1097   Customer_97       Corporate  Bangalore
97        1098   Customer_98  Small Business     Nanded
98        1099   Customer_99  Small Business     Nanded
99        1100  Customer_100        Consumer     Mumbai

[100 rows x 4 columns]

In [6]:
Sales['OrderDate'] = pd.to_datetime(Sales['OrderDate'])

Sales['Sales'] = Sales['Quantity'] * Sales['UnitPrice']
Sales['Year'] = Sales['OrderDate'].dt.year
Sales['Month'] = Sales['OrderDate'].dt.month
Sales['Day'] = Sales['OrderDate'].dt.day

In [8]:
df.groupby('Category')['Sales'].sum()

Category
Beverages      2007622
Clothing       1262188
Electronics     435286
Furniture      2548685
Grocery        2051600
Name: Sales, dtype: int64

In [9]:
df.groupby(['Year','Month'])['Sales'].sum().sort_values(ascending = False)

Year  Month
2024  10       422006
      9        414452
      7        392370
2023  12       382424
2024  5        377325
2023  6        366031
      2        357865
      4        355843
      8        354862
      5        353241
2024  4        352793
2023  1        347103
2024  2        342834
2023  10       339851
2024  8        335294
      12       324694
2023  11       323336
      3        320292
2024  1        319392
2023  9        316390
2024  3        311994
      11       303483
      6        300327
2023  7        291179
Name: Sales, dtype: int64

In [10]:
df[(df['Region']=='South')].groupby('City')['Sales'].sum().sort_values(ascending = False)

City
Nanded       567501
Mumbai       453264
Bangalore    445722
Pune         303577
Delhi        301593
Name: Sales, dtype: int64

In [12]:
df = pd.read_csv("Retailer_Master.csv")

In [13]:
df

,OrderID,OrderDate,CustomerID,ProductID,Region,Quantity,UnitPrice,Cost_x,Profit,Sales,Year,Month,Day,ProductName,Category,Cost_y,CustomerName,Segment,City
0,5001,2024-10-01,1076,17,South,9,824,104.0,6480.0,7416,2024,10,1,Product_17,Beverages,104,Customer_76,Corporate,Nanded
1,5016,2023-10-31,1087,17,South,9,234,104.0,1170.0,2106,2023,10,31,Product_17,Beverages,104,Customer_87,Small Business,Bangalore
2,5032,2024-11-03,1028,17,West,9,814,104.0,6390.0,7326,2024,11,3,Product_17,Beverages,104,Customer_28,Corporate,Nanded
3,5034,2024-08-09,1084,17,East,1,212,104.0,108.0,212,2024,8,9,Product_17,Beverages,104,Customer_84,Small Business,Mumbai
4,5048,2023-06-12,1010,17,South,7,610,104.0,3542.0,4270,2023,6,12,Product_17,Beverages,104,Customer_10,Corporate,Pune
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2995,7894,2024-07-15,1090,5,East,5,439,394.0,225.0,2195,2024,7,15,Product_5,Furniture,394,Customer_90,Corporate,Nanded
2996,7897,2023-11-21,1020,5,East,8,497,394.0,824.0,3976,2023,11,21,Product_5,Furniture,394,Customer_20,Small Business,Delhi
2997,7903,2023-11-20,1001,5,East,9,211,394.0,NaN,1899,2023,11,20,Product_5,Furniture,394,Customer_1,Consumer,Delhi
2998,7927,2024-05-19,1043,5,South,6,794,394.0,2400.0,4764,2024,5,19,Product_5,Furniture,394,Customer_43,Corporate,Mumbai
2999,7954,2024-01-15,1012,5,North,1,184,394.0,NaN,184,2024,1,15,Product_5,Furniture,394,Customer_12,Consumer,Bangalore

In [49]:
Query = """
SELECT 
    s.*,      -- Sales table
    o.*,      -- Product table
    c.*       -- Customer table
FROM [dbo].[Sales Details] s
JOIN [dbo].[Product Details] o
    ON s.ProductID = o.ProductID
JOIN [dbo].[Customers Details] c
    ON s.CustomerID = c.CustomerID;
"""
df = pd.read_sql(Query, conn)
df

C:\Users\Pavan Javale\AppData\Local\Temp\ipykernel_20124\4191232581.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(Query, conn)

,OrderID,OrderDate,CustomerID,ProductID,Region,Quantity,UnitPrice,Cost,Profit,ProductID,ProductName,Category,Cost,CustomerID,CustomerName,Segment,City
0,5001,2024-10-01,1076,17,South,9,824,104.0,6480.0,17,Product_17,Beverages,104,1076,Customer_76,Corporate,Nanded
1,5016,2023-10-31,1087,17,South,9,234,104.0,1170.0,17,Product_17,Beverages,104,1087,Customer_87,Small Business,Bangalore
2,5032,2024-11-03,1028,17,West,9,814,104.0,6390.0,17,Product_17,Beverages,104,1028,Customer_28,Corporate,Nanded
3,5034,2024-08-09,1084,17,East,1,212,104.0,108.0,17,Product_17,Beverages,104,1084,Customer_84,Small Business,Mumbai
4,5048,2023-06-12,1010,17,South,7,610,104.0,3542.0,17,Product_17,Beverages,104,1010,Customer_10,Corporate,Pune
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2995,7894,2024-07-15,1090,5,East,5,439,394.0,225.0,5,Product_5,Furniture,394,1090,Customer_90,Corporate,Nanded
2996,7897,2023-11-21,1020,5,East,8,497,394.0,824.0,5,Product_5,Furniture,394,1020,Customer_20,Small Business,Delhi
2997,7903,2023-11-20,1001,5,East,9,211,394.0,NaN,5,Product_5,Furniture,394,1001,Customer_1,Consumer,Delhi
2998,7927,2024-05-19,1043,5,South,6,794,394.0,2400.0,5,Product_5,Furniture,394,1043,Customer_43,Corporate,Mumbai
2999,7954,2024-01-15,1012,5,North,1,184,394.0,NaN,5,Product_5,Furniture,394,1012,Customer_12,Consumer,Bangalore

In [20]:
Sales

,OrderID,OrderDate,CustomerID,ProductID,Region,Quantity,UnitPrice,Cost,Profit,Sales,Year,Month,Day
0,5001,2024-10-01,1076,17,South,9,824,104.0,6480.0,7416,2024,10,1
1,5016,2023-10-31,1087,17,South,9,234,104.0,1170.0,2106,2023,10,31
2,5032,2024-11-03,1028,17,West,9,814,104.0,6390.0,7326,2024,11,3
3,5034,2024-08-09,1084,17,East,1,212,104.0,108.0,212,2024,8,9
4,5048,2023-06-12,1010,17,South,7,610,104.0,3542.0,4270,2023,6,12
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2995,7894,2024-07-15,1090,5,East,5,439,394.0,225.0,2195,2024,7,15
2996,7897,2023-11-21,1020,5,East,8,497,394.0,824.0,3976,2023,11,21
2997,7903,2023-11-20,1001,5,East,9,211,394.0,NaN,1899,2023,11,20
2998,7927,2024-05-19,1043,5,South,6,794,394.0,2400.0,4764,2024,5,19
2999,7954,2024-01-15,1012,5,North,1,184,394.0,NaN,184,2024,1,15

In [14]:
df = pd.read_csv("Retailer_Master.csv")